sandeepj-engineer/stm32f407vgt6_device_drivers_baremetal/app/src/03_all_led.c
/*
 * 01_led_toggle.c
 *
 *  Created on: Nov 4, 2025
 *      Author: Sandeep J
 */

#include "stm32f407xx_gpio_driver.h"

/**
 * @brief
 *
 */
static void delay (void)
{

    for( uint32_t i = 0; i < 500000; i++);

}

/**
 * @brief
 *
 * @return int
 */

int main(void)
{
    GPIO_Handle_t GPIOLed;

    GPIOLed.pGPIOx=GPIOD; //GPIO base address

    //pin configuration
    GPIOLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
    GPIOLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
    GPIOLed.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
    GPIOLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
    GPIOLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
    GPIO_Init(&GPIOLed);

    GPIOLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_13;
    GPIOLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
    GPIOLed.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
    GPIOLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
    GPIOLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
    GPIO_Init(&GPIOLed);

    GPIOLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_14;
    GPIOLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
    GPIOLed.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
    GPIOLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
    GPIOLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
    GPIO_Init(&GPIOLed);

    GPIOLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_15;
    GPIOLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
    GPIOLed.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
    GPIOLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
    GPIOLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
    GPIO_Init(&GPIOLed);

    GPIO_PeripheralClockControl(GPIOD, ENABLE);

    while (1)
    {
        GPIO_ToggleOutputPin(GPIOD, GPIO_PIN_NO_12);
		GPIO_ToggleOutputPin(GPIOD, GPIO_PIN_NO_13);
		GPIO_ToggleOutputPin(GPIOD, GPIO_PIN_NO_14);
		GPIO_ToggleOutputPin(GPIOD, GPIO_PIN_NO_15);
        delay();
    }


    return 0;
}
